--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY HASSN_BKS                   ▀▄ ▄▀ 
▀▄ ▄▀     BY Th3_BOOS (@HASSN_BKS)    ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY HASSN_BKS          ▀▄ ▄▀   
▀▄ ▄▀          help1  : مساعدة             ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "مساعدة" then
return [[🔰💠 - اوامر الرفع في الكروب💠♨️
➖🔸➖🔹➖🔸➖🔹➖ـ
🔚لرفع اداري [رفع اداري]
🔚لحذف اداري[تنزيل اداري]
🔚لضافه المدير[رفع المدير ]
🔚لاضافه ادمن [رفع ادمن]
🔚لتنزيل الادمن [تنزيل ادمن]
🔚 لضافه مطور[اضف مطور +معرف]
🔚اضهار الادمنيه[الادمنيه]
🔚اضهار المدير[مدير المجموعه]
------------------------------------------------------------
🚷اوامر الطرد من المجموعه
🔚لطرد العضو [بلوك ]
🔚لحضر العضو [حظر]
🔚لفك الحظر عن العضو [الغاء الحظر]
🔚للخروج من المجموعه [مغادره]
🔚لكتم العضو [كتم ]
🔚لالغاء كتم العضو [كتم]
🔚عرض المكتومين [المكتومين]
🔚لحضر الكلمات في المجموعه [منع+الكلمه]
🔚لفتح حضر الكلمه [الغاء المنع+الكلمه]
🔚لعرض الكلمات المحظوره[قائمه المنع]
🔚للحضر عام [حظر عام]
🔚للغاء العام [الغاء العام]
🔚لعرض المحضورين عام[قائمه العام]
------------------------------------------------------------
🌐اوامر الكروب الاعتياديه
🔚لعرض ايديك في المجموعه[ايدي]
🔚اضهار المعلومات الخاصه بك[معلوماتي 
🔚المعلومات الخاصه [معلومات المجموعه ]
🔚لاضهار القوانين [القوانين]
🔚لمسح اي كلمه بل رد[مسح]
🔚اضفه قوانين[ضع قوانين]
🔚اضافه وصف[ضع وصف]
🔚لاضافه اسم [وضع اسم]
🔚لوضع معرف المجموعه[ضع معرف]
🔚لاضافه صوره[وضع صوره]
🔚لجلب الرابط خاص [الرابط خاص]
🔚لعرض الرابط [الرابط]
🔚لصنع رابط [تغير الرابط]
🔚لتحويل الئ سوبر[ترقيه سوبر]
🔚لتفعيل المجموعه [تفعيل]
🔚الغاء تفعيل المجموعه[تعطيل]
🔚لتحويل الملصق صوره[صوره]
🔚لمعرفه موقعك [شنو اني]
🔚اضهار الاعدادات المجموعه[الاعدادات]
🔚اضهار اعدادات الوسائط [اعدادات الوسائط]
------------------------------------------------------------
🌐اوامر الحمايه
🔚فتح 🔓قفل🔒[الاضافه]
🔚فتح 🔓قفل 🔒[البوتات]
🔚فتح 🔓قفل 🔒[المجموعه]
🔚فتح 🔓قفل 🔒[الدردشه]
🔚فتح 🔓قفل 🔒[الصور ]
🔚فتح 🔓قفل 🔒[الصوت]
🔚فتح 🔓قفل 🔒[الفيديو]
🔚فتح 🔓قفل 🔒[الروابط]
🔚فتح 🔓قفل 🔒[التكرار]
🔚فتح 🔓قفل 🔒[الملصقات]
🔚فتح 🔓قفل 🔒[الصور المتحركه]
🔚فتح 🔓قفل 🔒[الفايلات]
🔚فتح 🔓قفل 🔒[الكلايش]
🔚فتح 🔓قفل 🔒[الاضافه الجماعيه]
🔚فتح 🔓قفل 🔒[العربيه]
🔚فتح 🔓قفل 🔒[اعاده توجيه]
🔚المراقبه[نعم -لا ]
🔚لوضع التكرار بين 5 الئ 20 [ضع التكرار]
🔚لحذف جميع رسائل الكروب[مسح رسائل المجموعه]
🔚لحذف رسائل العضو بل رد[مسح رسائل العضو]
🔚لحذف لادمنيه[مسح الادمنيه]
🔚لحذف الوصف[مسح الوصف]
🔚لحذف القوانين[مسح القوانين]
🔚لحذف معرف المجموعه[مسح المعرف]
🔚يستعمل لجلب معلومات الانستا [انستا+يوزر]

 :للتواصل مع المطور
__________________
♠️ - Dev - @HASSN_BKS

]]
end

if not is_momod(msg) then
return "للمشرفين فقط "
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(مساعدة)"
},
run = run 
}
end
